; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v3 ?v6)
             (pred_2 ?v5 ?v10)
             (pred_10 ?v3 ?v10)
             (pred_1 ?v2 ?v3 )
	     (pred_11 ?v3)
             (pred_9 ?v13)
             (pred_3 ?v5)
             (pred_5 ?v10)
             (pred_7 ?v3)
             (pred_8 ?v5)
             (pred_12 ?v3)
             (pred_6 ))



(:action op_5
:parameters (?v1 ?v9 ?v12 ?v4)
:precondition (and (pred_9 ?v1) (pred_9 ?v9) (pred_3 ?v12) (pred_5 ?v4)
          (pred_4 ?v1 ?v9) (pred_2 ?v12 ?v4)
                   (pred_10 ?v9 ?v4) (pred_11 ?v1) 
                   (pred_7 ?v9) (pred_8 ?v12))
:effect (and  (pred_12 ?v9) (not (pred_7 ?v9))))


(:action op_3
:parameters (?v1 ?v7)
:precondition (and (pred_9 ?v1) (pred_9 ?v7)
               (pred_11 ?v1) (pred_4 ?v1 ?v7) (pred_12 ?v7))
:effect (and (pred_11 ?v7) (not (pred_11 ?v1))))

(:action op_1
:parameters (?v1 ?v12)
:precondition (and (pred_9 ?v1) (pred_3 ?v12) 
                  (pred_11 ?v1) (pred_1 ?v12 ?v1) (pred_6 ))
:effect (and (pred_8 ?v12)
   (not (pred_1 ?v12 ?v1)) (not (pred_6 ))))


(:action op_2
:parameters (?v1 ?v11 ?v8)
:precondition (and (pred_9 ?v1) (pred_3 ?v11) (pred_3 ?v8)
                  (pred_11 ?v1) (pred_8 ?v8) (pred_1 ?v11 ?v1))
:effect (and (pred_8 ?v11) (pred_1 ?v8 ?v1)
        (not (pred_8 ?v8)) (not (pred_1 ?v11 ?v1))))

(:action op_4
:parameters (?v1 ?v12)
:precondition (and (pred_9 ?v1) (pred_3 ?v12) 
                  (pred_11 ?v1) (pred_8 ?v12))
:effect (and (pred_6 ) (pred_1 ?v12 ?v1) (not (pred_8 ?v12)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_30 obj_26 obj_05 obj_15 obj_16 obj_23 obj_29 obj_04 obj_07 obj_25 obj_19 obj_03 obj_27 obj_12 obj_21 obj_20 obj_14 obj_08 obj_28 obj_32 obj_22 obj_17 obj_09 obj_10 obj_01
    obj_31 obj_11 obj_18
    obj_06 obj_02 obj_24 obj_13
    )

    (:init
       (pred_6)

       (pred_9 obj_30)
       (pred_9 obj_26)
       (pred_9 obj_05)
       (pred_9 obj_15)
       (pred_9 obj_16)
       (pred_9 obj_23)
       (pred_9 obj_29)
       (pred_9 obj_04)
       (pred_9 obj_07)
       (pred_9 obj_25)
       (pred_9 obj_19)
       (pred_9 obj_03)
       (pred_9 obj_27)
       (pred_9 obj_12)
       (pred_9 obj_21)
       (pred_9 obj_20)
       (pred_9 obj_14)
       (pred_9 obj_08)
       (pred_9 obj_28)
       (pred_9 obj_32)
       (pred_9 obj_22)
       (pred_9 obj_17)
       (pred_9 obj_09)
       (pred_9 obj_10)
       (pred_9 obj_01)
       (pred_5 obj_31)
       (pred_5 obj_11)
       (pred_5 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_02)
       (pred_3 obj_24)
       (pred_3 obj_13)

       (pred_4 obj_30 obj_23)
       (pred_4 obj_30 obj_26)
       (pred_4 obj_26 obj_29)
       (pred_4 obj_26 obj_05)
       (pred_4 obj_26 obj_30)
       (pred_4 obj_05 obj_04)
       (pred_4 obj_05 obj_15)
       (pred_4 obj_05 obj_26)
       (pred_4 obj_15 obj_07)
       (pred_4 obj_15 obj_16)
       (pred_4 obj_15 obj_05)
       (pred_4 obj_16 obj_25)
       (pred_4 obj_16 obj_15)
       (pred_4 obj_23 obj_19)
       (pred_4 obj_23 obj_29)
       (pred_4 obj_23 obj_30)
       (pred_4 obj_29 obj_03)
       (pred_4 obj_29 obj_04)
       (pred_4 obj_29 obj_26)
       (pred_4 obj_29 obj_23)
       (pred_4 obj_04 obj_27)
       (pred_4 obj_04 obj_07)
       (pred_4 obj_04 obj_05)
       (pred_4 obj_04 obj_29)
       (pred_4 obj_07 obj_12)
       (pred_4 obj_07 obj_25)
       (pred_4 obj_07 obj_15)
       (pred_4 obj_07 obj_04)
       (pred_4 obj_25 obj_21)
       (pred_4 obj_25 obj_16)
       (pred_4 obj_25 obj_07)
       (pred_4 obj_19 obj_20)
       (pred_4 obj_19 obj_03)
       (pred_4 obj_19 obj_23)
       (pred_4 obj_03 obj_14)
       (pred_4 obj_03 obj_27)
       (pred_4 obj_03 obj_29)
       (pred_4 obj_03 obj_19)
       (pred_4 obj_27 obj_08)
       (pred_4 obj_27 obj_12)
       (pred_4 obj_27 obj_04)
       (pred_4 obj_27 obj_03)
       (pred_4 obj_12 obj_28)
       (pred_4 obj_12 obj_21)
       (pred_4 obj_12 obj_07)
       (pred_4 obj_12 obj_27)
       (pred_4 obj_21 obj_32)
       (pred_4 obj_21 obj_25)
       (pred_4 obj_21 obj_12)
       (pred_4 obj_20 obj_22)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_20 obj_19)
       (pred_4 obj_14 obj_17)
       (pred_4 obj_14 obj_08)
       (pred_4 obj_14 obj_03)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_08 obj_28)
       (pred_4 obj_08 obj_27)
       (pred_4 obj_08 obj_14)
       (pred_4 obj_28 obj_10)
       (pred_4 obj_28 obj_32)
       (pred_4 obj_28 obj_12)
       (pred_4 obj_28 obj_08)
       (pred_4 obj_32 obj_01)
       (pred_4 obj_32 obj_21)
       (pred_4 obj_32 obj_28)
       (pred_4 obj_22 obj_17)
       (pred_4 obj_22 obj_20)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_14)
       (pred_4 obj_17 obj_22)
       (pred_4 obj_09 obj_10)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_10 obj_01)
       (pred_4 obj_10 obj_28)
       (pred_4 obj_10 obj_09)
       (pred_4 obj_01 obj_32)
       (pred_4 obj_01 obj_10)
       (pred_7 obj_14)
       (pred_7 obj_29)
       (pred_7 obj_16)
       (pred_7 obj_28)
       (pred_10  obj_14 obj_31)
       (pred_10  obj_29 obj_11)
       (pred_10  obj_16 obj_18)
       (pred_10  obj_28 obj_18)
       (pred_12 obj_30)
       (pred_12 obj_26)
       (pred_12 obj_05)
       (pred_12 obj_15)
       (pred_12 obj_23)
       (pred_12 obj_04)
       (pred_12 obj_07)
       (pred_12 obj_25)
       (pred_12 obj_19)
       (pred_12 obj_03)
       (pred_12 obj_27)
       (pred_12 obj_12)
       (pred_12 obj_21)
       (pred_12 obj_20)
       (pred_12 obj_08)
       (pred_12 obj_32)
       (pred_12 obj_22)
       (pred_12 obj_17)
       (pred_12 obj_09)
       (pred_12 obj_10)
       (pred_12 obj_01)

       (pred_2  obj_06 obj_31)
       (pred_2  obj_02 obj_11)
       (pred_2  obj_24 obj_18)
       (pred_2  obj_13 obj_18)
       (pred_1 obj_06 obj_08)
       (pred_1 obj_02 obj_19)
       (pred_1 obj_24 obj_32)
       (pred_1 obj_13 obj_30)
       (pred_11 obj_03)
    )

    (:goal (and
       (pred_1 obj_06 obj_01)
       (pred_1 obj_13 obj_27)
    ))
(:constraints
  (always (not (pred_11 obj_05)))
)
)

; plan
1. (op_3 obj_03 obj_27)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_27)
   goals met: 0 of 2
2. (op_3 obj_27 obj_08)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_08)
   goals met: 0 of 2
3. (op_1 obj_08 obj_06)
   deleted: (pred_1 obj_06 obj_08) (pred_6)
   added: (pred_8 obj_06)
   goals met: 0 of 2
4. (op_3 obj_08 obj_27)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_27)
   goals met: 0 of 2
5. (op_3 obj_27 obj_03)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_03)
   goals met: 0 of 2
6. (op_3 obj_03 obj_19)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_19)
   goals met: 0 of 2
7. (op_3 obj_19 obj_23)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_23)
   goals met: 0 of 2
8. (op_3 obj_23 obj_30)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_30)
   goals met: 0 of 2
9. (op_2 obj_30 obj_13 obj_06)
   deleted: (pred_8 obj_06) (pred_1 obj_13 obj_30)
   added: (pred_8 obj_13) (pred_1 obj_06 obj_30)
   goals met: 0 of 2
10. (op_3 obj_30 obj_23)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_23)
   goals met: 0 of 2
11. (op_3 obj_23 obj_19)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_19)
   goals met: 0 of 2
12. (op_3 obj_19 obj_03)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_03)
   goals met: 0 of 2
13. (op_3 obj_03 obj_27)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_27)
   goals met: 0 of 2
14. (op_4 obj_27 obj_13)
   deleted: (pred_8 obj_13)
   added: (pred_6) (pred_1 obj_13 obj_27)
   goals met: 1 of 2
15. (op_3 obj_27 obj_03)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_03)
   goals met: 1 of 2
16. (op_3 obj_03 obj_19)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_19)
   goals met: 1 of 2
17. (op_3 obj_19 obj_23)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_23)
   goals met: 1 of 2
18. (op_3 obj_23 obj_30)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_30)
   goals met: 1 of 2
19. (op_1 obj_30 obj_06)
   deleted: (pred_1 obj_06 obj_30) (pred_6)
   added: (pred_8 obj_06)
   goals met: 1 of 2
20. (op_3 obj_30 obj_23)
   deleted: (pred_11 obj_30)
   added: (pred_11 obj_23)
   goals met: 1 of 2
21. (op_3 obj_23 obj_19)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_19)
   goals met: 1 of 2
22. (op_3 obj_19 obj_03)
   deleted: (pred_11 obj_19)
   added: (pred_11 obj_03)
   goals met: 1 of 2
23. (op_3 obj_03 obj_27)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_27)
   goals met: 1 of 2
24. (op_3 obj_27 obj_12)
   deleted: (pred_11 obj_27)
   added: (pred_11 obj_12)
   goals met: 1 of 2
25. (op_3 obj_12 obj_21)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_21)
   goals met: 1 of 2
26. (op_3 obj_21 obj_32)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_32)
   goals met: 1 of 2
27. (op_3 obj_32 obj_01)
   deleted: (pred_11 obj_32)
   added: (pred_11 obj_01)
   goals met: 1 of 2
28. (op_4 obj_01 obj_06)
   deleted: (pred_8 obj_06)
   added: (pred_6) (pred_1 obj_06 obj_01)
   goals met: 2 of 2
